#### RemoveAddInCommandBinding Method

---

|  |
| --- |
| UIApplication Class   See Also |

Removes an AddInCommandBinding.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void RemoveAddInCommandBinding( 	RevitCommandId revitCommandId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub RemoveAddInCommandBinding ( _ 	revitCommandId As RevitCommandId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void RemoveAddInCommandBinding( 	RevitCommandId^ revitCommandId ) ``` |

#### Parameters

revitCommandId
:   Type:  Autodesk.Revit.UI RevitCommandId
     The Revit command id to identify the command handler you want to remove the binding.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when uiApplication or revitCommandId is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the given command is not bound with this add-in. |

# See Also

UIApplication Class

Autodesk.Revit.UI Namespace